{
	"term" : "Angular",
	"summary" : "A structural framework for dynamic web apps",
	"definitions" : [
		{
			"definition" : "It lets you use HTML as your template language and lets you extend HTML's syntax to express your application's components clearly and succinctly. AngularJS's data binding and dependency injection eliminate much of the code you would otherwise have to write. And it all happens within the browser, making it an ideal partner with any server technology.\r\n\r\nAngularJS is what HTML would have been, had it been designed for applications.",
			"source" : "https://docs.angularjs.org/guide/introduction",
			"rating" : 0
		}
	]
}

{
	"term" : "Atom",
	"summary" : "Atom is a hackable and customizable text editor",
	"definitions" : [
		{
			"definition" : "Atom is built with HTML, JavaScript, CSS, and Node.js integration.\r\nIt's easy to customize and style Atom. You can tweak the look and feel of your UI with CSS/Less and add major features with HTML and JavaScript. \r\n\r\nYou choose from thousands of open source packages that add new features and functionality to Atom—or build a package from scratch and publish it for everyone else to use.",
			"source" : "https://atom.io/",
			"rating" : 0
		}
	]
}

{
	"term" : "API",
	"summary" : "A set of routines, protocols, and tools for building software applications",
	"definitions" : [
		{
			"definition" : "Atom is built with HTML, JavaScript, CSS, and Node.js integration.\r\nIt's easy to customize and style Atom. You can tweak the look and feel of your UI with CSS/Less and add major features with HTML and JavaScript. \r\n\r\nYou choose from thousands of open source packages that add new features and functionality to Atom—or build a package from scratch and publish it for everyone else to use.",
			"source" : "https://atom.io/",
			"rating" : 0
		}
	]
}

}

{
	"term" : "Capybara",
	"summary" : "A large rodent",
	"definitions" : [
		{
			"definition" : "Capybara is a web-based automation framework used for creating functional tests that simulate how users would interact with your application. Today, there are many alternatives for web-based automation tools, such as Selenium, Watir, Capybara, etc. All of these tools have the same purpose, but there are slight differences that make each of them more or less suitable.",
			"source" : "https://www.sitepoint.com/basics-capybara-improving-tests/",
			"rating" : 0
		}
	]
}

}

{
	"term" : ".NET",
	"summary" : "Enables rapid development by bundling a collection of software in one package.",
	"definitions" : [
		{
			"definition" : "Atom is built with HTML, JavaScript, CSS, and Node.js integration.\r\nIt's easy to customize and style Atom. You can tweak the look and feel of your UI with CSS/Less and add major features with HTML and JavaScript. \r\n\r\nYou choose from thousands of open source packages that add new features and functionality to Atom—or build a package from scratch and publish it for everyone else to use..NET is a Microsoft web services strategy to connect information, people, systems, and devices through software, making it easier for users to share and use their information between multiple websites, programs, and computers. Also, being a web service, .NET is also a programming model that enables software developers the ability to do rapid application development by bundling a collection of software in on package. For example, Microsoft Visual Studio .NET is part of the .NET programming model.",
			"source" : "http://www.computerhope.com/jargon/n/dotnet.htm",
			"rating" : 0
		}
	]
}

}

{
	"term" : "DOM",
	"summary" : "A tree-like structured representation of the document."
		{
			"definition" : "The Document Object Model (DOM) is a programming interface for HTML and XML documents. It provides a structured representation of the document and it defines a way that the structure can be accessed from programs so that they can change the document structure, style and content. The DOM provides a representation of the document as a structured group of nodes and objects that have properties and methods. Essentially, it connects web pages to scripts or programming languages. A Web page is a document. This document can be either displayed in the browser window, or as the HTML source. But it is the same document in both cases. The Document Object Model (DOM) provides another way to represent, store and manipulate that same document. The DOM is a fully object-oriented representation of the web page, and it can be modified with a scripting language such as JavaScript.",
			"source" : "https://developer.mozilla.org/en-US/docs/Web/API/Document_Object_Model/Introduction",
			"rating" : 0
		}
	]
}

}

{
	"term" : "API",
	"summary" : "An open-source NoSQL document database.",
	"definitions" : [
		{
			"definition" : "MongoDB bridges the gap between key-value stores, which are fast and scalable, and relational databases, which have rich functionality. Instead of storing data in rows and columns as one would with a relational database, MongoDB stores JSON documents in collections with dynamic schemas. MongoDB's document data model makes it easy for you to store and combine data of any structure, without giving up sophisticated validation rules, flexible data access, and rich indexing functionality. You can dynamically modify the schema without downtime – vital for rapidly evolving applications.",
			"source" : "https://www.mongodb.com/blog/post/the-modern-application-stack-part-1-introducing-the-mean-stack",
			"rating" : 0
		}
	]
}

}

{
	"term" : "XML",
	"summary" : "An Extensible Markup Language to transport data",
	"definitions" : [
		{
			"definition" : "- XML stands for eXtensible Markup Language \
- XML is a markup language much like HTML \
- XML was designed to store and transport data \
- XML was designed to be self-descriptive \
- XML doesn't actually do anything! It's just information wrapped in tags. Someone must write a piece of software to send, receive, store, or display it \
- XML and HTML were designed with different goals: \
- XML was designed to carry data - with focus on what data is \
- HTML was designed to display data - with focus on how data looks \
- XML tags are not predefined like HTML tags are",
			"source" : "https://www.w3schools.com/xml/xml_whatis.asp",
			"rating" : 0
		}
	]
}

}

{
	"term" : "Continuous integration",
	"summary" : "Automated building",
	"definitions" : [
		{
			"definition" : "It is development practice that requires developers to integrate code into a shared repository several times a day. Each check-in is then verified by an automated build, allowing teams to detect problems early.",
			"source" : "https://techterms.com/definition/cookie",
			"rating" : 0
		}
	]
}

}
{
	"term" : "SVG",
	"summary" : "Scalable Vector Graphics",
	"definitions" : [
		{
			"definition" : "Scalable Vector Graphics are an XML based markup that can contain two-dimensional vectors. The vectors can be simple shapes, paths, or well just about anything you can do in Illustrator. It’s an image format that has more in common with a web page that it does with a JPEG. SVG is much more powerful than other image formats we can use on the web as we can manipulate them with code (either in our text editor or with CSS / JS).",
			"source" : "https://svgontheweb.com/",
			"rating" : 0
		}
	]
}
